uliano/brio/brio/stm32f4/clock.hpp
/*
 * clock.hpp
 *
 * The STM32F4 clock tree (RCC, RM0090 ch. 6/7, RM0390 ch. 6, RM0383
 * ch. 6) in the two strata every brio target uses (docs/design/clock.md):
 *
 *  RESOURCES - monostates, thin typed views with the discipline built in:
 *    Rcc      the reset and clock control block: the HSI root, the HSE
 *             root (crystal or bypass), the main PLL (configure, start,
 *             lock), the SYSCLK switch with its status readback, the
 *             AHB/APB prescalers, the PERIPHERAL CLOCK ENABLES (one bit
 *             per peripheral in AHB1ENR/AHB2ENR/AHB3ENR/APB1ENR/APB2ENR)
 *             and resets, the two MCO outputs, and the AUDIO PLL with the
 *             I2S clock selector that is the I2S chapter's kernel clock
 *    (`Pwr` - the regulator scale and the over-drive pair the task
 *    below sequences - lives in stm32f4/pwr.hpp; the flash latency in
 *    stm32f4/flash.hpp. One chapter, one owner.)
 *
 *  TASKS - what an application names:
 *    Clock<source, hz, hse_hz, hse_mode>   the static main clock: ONE
 *             constexpr truth `hz` every driver derives from (there is
 *             no F_CPU in this build); init() composes the resources
 *             and reports whether the requested root runs.
 *    Rates<R0, R1, ...> + DynamicClock<Rates<...>, Users...>   the
 *             runtime regime: a PACK of static Clock tasks, R0 the boot
 *             rate, `set<hz>()`/`set(hz)` fanning the new rate out to the
 *             listed ClockUsers and then switching, `restore()` after a
 *             Stop. Its own header comment carries the ordering rules.
 *
 * THE CLOCK MODEL: THE STM32G0'S, WITH THE PRESCALERS NO LONGER PINNED.
 * This family has one SYSCLK, SHARED PRESCALERS below it (HPRE for AHB,
 * PPRE1 and PPRE2 for the two APBs) and an ENABLE BIT per peripheral
 * that gates its bus clock - the STM32G0's model. What the G0 stratum
 * could do and this one cannot is pin every prescaler at 1: the APBs
 * have CEILINGS (45 and 90 MHz on the F42x/F43x and F446, 42 and 84 on
 * the F405 class, 50 and 100 on the F411 - the reserve's ladder) and a
 * core at 180 MHz cannot feed them undivided. So `hz` is SYSCLK = HCLK
 * (HPRE stays 1), and beside it the task states `pclk1_hz` and
 * `pclk2_hz`, each the largest power-of-two division of HCLK under its
 * bus's ceiling - and a driver on an APB asks `apb_hz(clock, on_apb2)`
 * for the rate that is really its own (the USART's divisor divides its
 * bus clock, not SYSCLK). What crosses the util contract is unchanged:
 * `clock_hz(clock)` is SYSCLK = HCLK. The timers' kernel clock (twice
 * the APB clock when the APB is divided, RM0090 7.3.3's TIMPRE rule)
 * is the timer chapter's to state.
 *
 * THREE THINGS ON THE WAY UP, IN THE CHAPTER'S ORDER. Raising this
 * family above its 16 MHz reset rate is a sequence the manuals spell
 * out and this task follows literally (RM0090 5.1.4, 3.5.1, 7.3.3):
 *   1. the REGULATOR SCALE (PWR_CR.VOS) for the target rate, written
 *      while the PLL is off and SYSCLK is HSI or HSE - the reset state;
 *   2. the PLL configured and started; where the rate needs OVER-DRIVE
 *      (above 168 MHz on the parts that have it, or above 144 at scale 2)
 *      the over-drive pair is sequenced now, between the PLL's start and
 *      the switch to it, with no peripheral clock yet enabled;
 *   3. the FLASH LATENCY for the target HCLK, read back; the ART
 *      accelerator on; the APB prescalers for the target rate; the PLL
 *      waited for; the switch, and SWS read back.
 * `Clock::init()` itself sequences no fall: it runs once from the reset
 * state, and every rate a program names is a rise from 16 MHz. THE FALL
 * IS `DynamicClock`'S, and on this family it is one move and not a
 * mirror image - a switch parks SYSCLK on the HSI first, because neither
 * the PLL nor the regulator scale nor the over-drive bits may be written
 * with the PLL running; after the park every rate is a rise. Its own
 * header comment says the rest.
 *
 * THE PLL RATIO IS SEARCHED AT COMPILE TIME under the chapter's limits
 * (RM0090 7.3.2): the input divided by M must land in 1..2 MHz (2 MHz
 * "to limit PLL jitter" - the search takes the smallest M, which is the
 * largest input the window allows), the VCO in 100..432 MHz, N in
 * 50..432, P in {2, 4, 6, 8}; an EXACT ratio or a compile error naming
 * the rule. Q, the 48 MHz output for USB OTG FS, SDIO and the RNG, is
 * the smallest divider that keeps VCO / Q at or below 48 MHz, and
 * `usb_hz` says what came out: 48 MHz exactly at 168 or 96 MHz, 45 MHz
 * at 180 (a USB program picks 168; the chapter's own choice).
 *
 * WHAT IS BUILT: `hsi` (HSI undivided, 16 MHz - the reset state, the
 * one rate every header runs at with no ladder read), `hse` (the
 * crystal or the bypassed clock undivided), `pll_hsi` and `pll_hse` (the
 * PLL from either root). LSI, LSE, the SAI PLL and the AHB prescaler are
 * DECLARED and refused.
 *
 * NEITHER OF THE OTHER TWO PLLS IS A SYSCLK ROOT, and neither is
 * therefore a Clock task's business. PLLI2S feeds the I2S kernel clock
 * alone and PLLSAI the display controller's pixel clock (and the audio
 * interface's), both off the same root and the same PLLM the main PLL
 * uses, so their verbs sit on `Rcc` - the block that owns PLLI2SCFGR,
 * PLLSAICFGR and the two selectors in RCC_DCKCFGR - and stm32f4/spi.hpp
 * and stm32f4/ltdc.hpp are what call them. Where the header declares no
 * PLLI2SON or no PLLSAION that PLL is not there and every one of its
 * verbs answers false; and PLLSAI's R output, the pixel clock's, exists
 * only where a display does.
 *
 * BOARD FACTS the apps of this project state: 8 MHz from the ST-LINK's
 * MCO into HSE in bypass on the Nucleo-F446RE (UM1724 7.9.1, board
 * revision C-02 and up), an 8 MHz crystal on HSE on the STM32F429I-DISC1
 * (UM1670 7.12.1: X3 fitted, the MCO route's SB18 open - a bypass there
 * never sees HSERDY, measured), a 25 MHz crystal on the F411 black pill.
 *
 * Facts that shape the code (RM0090 7.2, 7.3; RM0383 6.2, 6.3):
 *  - out of reset the device runs HSI at 16 MHz as SYSCLK = HCLK =
 *    PCLK1 = PCLK2, FLASH_ACR.LATENCY 0, the accelerator off;
 *  - the HSE takes a crystal of 4..26 MHz or a bypassed clock of 1..50
 *    MHz (the datasheets' tables), HSEON then HSERDY; HSEBYP is written
 *    before HSEON;
 *  - PLLCFGR may be written only while the PLL is off (7.3.2); PLLON
 *    then PLLRDY;
 *  - 7.3.3: a SYSCLK switch takes effect only when the target is ready,
 *    and SWS reports which source is in force - init() waits for it;
 *    the APB prescaler cautions are the ceilings above;
 *  - 7.3.10 and its twins: a peripheral's enable bit needs a dummy read
 *    before the peripheral is used (ES0206 2.2.7, "Delay after an RCC
 *    peripheral clock enabling"); every bus-enable verb below reads the
 *    register back, which is that access.
 */
#pragma once

#include <stdint.h>

