uliano/brio/brio/stm32f4/clock.hpp
#include "stm32f4xx.h"

#include "stm32f4/device_tables.hpp"
#include "stm32f4/flash.hpp"
#include "stm32f4/pwr.hpp"
#include "util/clock.hpp"

namespace brio {

// ---- vocabulary -----------------------------------------------------------------

/// RCC_CFGR.SW / SWS encodings (7.3.3).
enum class SysclkSource : uint8_t { hsi = 0, hse = 1, pll = 2 };

/// The main PLL's fields (7.3.2): the input divider M (2..63), the VCO
/// multiplier N (50..432), the SYSCLK divider P (2, 4, 6, 8) and the
/// 48 MHz-domain divider Q (2..15). `m == 0` means "no configuration".
struct PllConfig {
    uint8_t m = 0;
    uint16_t n = 0;
    uint8_t p = 0;
    uint8_t q = 0;
    bool from_hse = false;
};

inline constexpr uint32_t pll_input_min_hz = 1'000'000u;
inline constexpr uint32_t pll_input_max_hz = 2'000'000u;
inline constexpr uint32_t pll_vco_min_hz = 100'000'000u;
inline constexpr uint32_t pll_vco_max_hz = 432'000'000u;
inline constexpr uint32_t pll_q_domain_max_hz = 48'000'000u;

/// The exact PLL ratio for `out_hz` from a `src_hz` root, or a config
/// with m == 0 when none exists under the limits. Smallest M first
/// (the largest legal input), then P ascending - the first exact N wins.
constexpr PllConfig pll_config_for(uint32_t src_hz, uint32_t out_hz, bool from_hse) {
    for (uint8_t m = 2; m <= 63; ++m) {
        if (src_hz % m != 0u) {
            continue;
        }
        const uint32_t in = src_hz / m;
        if (in < pll_input_min_hz || in > pll_input_max_hz) {
            continue;
        }
        for (uint8_t p = 2; p <= 8; p = static_cast<uint8_t>(p + 2)) {
            const uint32_t vco = out_hz * p;
            if (vco < pll_vco_min_hz || vco > pll_vco_max_hz) {
                continue;
            }
            if (vco % in != 0u) {
                continue;
            }
            const uint32_t n = vco / in;
            if (n < 50u || n > 432u) {
                continue;
            }
            uint8_t q = 2;
            while (q < 15 && vco / q > pll_q_domain_max_hz) {
                ++q;
            }
            return PllConfig{m, static_cast<uint16_t>(n), p, q, from_hse};
        }
    }
    return PllConfig{};
}

/// The audio PLL's fields (RM0090 7.3.23, RM0390 6.3.23, RM0383 6.3.22).
/// `m` is the input divider ON THE PARTS THAT HAVE ONE OF THEIR OWN
/// (`plli2s_has_m()`); where they have not, the audio PLL divides the MAIN
/// PLL's M and this field stays 0. `n` is the VCO multiplier (50..432), `r`
/// the I2S output divider (2..7); `q` (2..15) and `p` (2, 4, 6, 8) are the
/// other two outputs, written only where the header declares the field.
struct PllI2sConfig {
    uint8_t m = 0;
    uint16_t n = 0;
    uint8_t r = 0;
    uint8_t q = 0;
    uint8_t p = 0;
};

inline constexpr uint32_t plli2s_r_min = 2;
inline constexpr uint32_t plli2s_r_max = 7;

/// The R output a configuration produces from a `src_hz` root, with
/// `main_m` the main PLL's input divider for the parts whose audio PLL has
/// no M of its own. 0 when the configuration is empty.
constexpr uint32_t plli2s_r_hz(uint32_t src_hz, const PllI2sConfig& c, uint8_t main_m) {
    const uint8_t m = c.m != 0u ? c.m : main_m;
    if (m == 0u || c.n == 0u || c.r == 0u) {
        return 0u;
    }
    return (src_hz / m) * c.n / c.r;
}

/// The exact audio-PLL ratio for an R output of `out_hz`, under the main
/// PLL's own limits (the input 1..2 MHz, the VCO 100..432 MHz, N 50..432).
/// `m_fixed` names the input divider where the part has no PLLI2SM (pass
/// the main PLL's M); 0 lets the search choose one. `n == 0` when no exact
/// ratio exists - the caller then states a rate this root cannot make.
constexpr PllI2sConfig plli2s_config_for(uint32_t src_hz, uint32_t out_hz, uint8_t m_fixed = 0) {
    const uint8_t m_lo = m_fixed != 0u ? m_fixed : 2u;
    const uint8_t m_hi = m_fixed != 0u ? m_fixed : 63u;
    for (uint8_t m = m_lo; m <= m_hi; ++m) {
        if (m == 0u || src_hz % m != 0u) {
            continue;
        }
        const uint32_t in = src_hz / m;
        if (in < pll_input_min_hz || in > pll_input_max_hz) {
            continue;
        }
        for (uint8_t r = 2; r <= 7; ++r) {
            const uint32_t vco = out_hz * r;
            if (vco < pll_vco_min_hz || vco > pll_vco_max_hz || vco % in != 0u) {
                continue;
            }
            const uint32_t n = vco / in;
            if (n < 50u || n > 432u) {
                continue;
            }
            uint8_t q = 2;
            while (q < 15 && vco / q > pll_q_domain_max_hz) {
                ++q;
            }
            return PllI2sConfig{m_fixed != 0u ? uint8_t{0} : m, static_cast<uint16_t>(n), r, q, 2};
        }
    }
    return PllI2sConfig{};
}

/// The THIRD PLL's fields (RM0090 6.3.24), the one whose R output is the
/// display controller's pixel clock and whose Q output the audio
/// interface's. It has NO input divider of its own on any part of this
/// family: PLLM is the main PLL's, so the VCO input is whatever the
/// system clock already fixed. `n` is the VCO multiplier (50..432), `r`
/// the LCD output divider (2..7) and `q` the SAI one (2..15); `r` is
/// written only where the part declares the field (`pllsai_has_r()`).
struct PllSaiConfig {
    uint16_t n = 0;
    uint8_t q = 0;
    uint8_t r = 0;
};

inline constexpr uint32_t pllsai_r_min = 2;
inline constexpr uint32_t pllsai_r_max = 7;

/// RCC_DCKCFGR.PLLSAIDIVR - what the R output is divided by on its way
/// to LCD_CLK (6.3.25). The enumerator's value IS the divider, and the
/// register code is its log2 minus one.
enum class LcdClockDivider : uint8_t { div2 = 2, div4 = 4, div8 = 8, div16 = 16 };

constexpr uint8_t lcd_divider_code(LcdClockDivider d) {
    switch (d) {
        case LcdClockDivider::div2: return 0;
        case LcdClockDivider::div4: return 1;
        case LcdClockDivider::div8: return 2;
        default: return 3;
    }
}

/// The R output a configuration produces from a `src_hz` root, `main_m`
/// being the main PLL's input divider (this PLL has none of its own).
/// 0 when the configuration is empty.
constexpr uint32_t pllsai_r_hz(uint32_t src_hz, const PllSaiConfig& c, uint8_t main_m) {
    if (main_m == 0u || c.n == 0u || c.r == 0u) {
        return 0u;
    }
    return (src_hz / main_m) * c.n / c.r;
}

/// LCD_CLK: the R output over the DCKCFGR divider.
constexpr uint32_t lcd_clock_hz(uint32_t pllsai_r, LcdClockDivider d) {
    return pllsai_r / static_cast<uint32_t>(d);
}

/// A PLLSAI configuration and an LCD_CLK divider together: what a pixel
/// clock really takes, since the same rate is reachable through several
/// (N, R, divider) triples and only the triple is programmable.
struct LcdClockConfig {
    PllSaiConfig pll{};
    LcdClockDivider divider = LcdClockDivider::div2;
};

/// The exact triple for an LCD_CLK of `lcd_hz` off a `src_hz` root under
/// the main PLL's `main_m`, within the same VCO limits the other two
/// PLLs obey (the input 1..2 MHz, the VCO 100..432 MHz, N 50..432).
/// `pll.n == 0` when no exact triple exists - the caller then states a
/// pixel clock this root cannot make, and the driver refuses it rather
/// than running the panel a few per cent off.
constexpr LcdClockConfig lcd_clock_config_for(uint32_t src_hz, uint32_t lcd_hz, uint8_t main_m) {
    if (main_m == 0u || lcd_hz == 0u || src_hz % main_m != 0u) {
        return LcdClockConfig{};
    }
    const uint32_t in = src_hz / main_m;
    if (in < pll_input_min_hz || in > pll_input_max_hz) {
        return LcdClockConfig{};
    }
    constexpr LcdClockDivider dividers[] = {LcdClockDivider::div2, LcdClockDivider::div4,
                                            LcdClockDivider::div8, LcdClockDivider::div16};
    for (LcdClockDivider d : dividers) {
        const uint32_t r_out = lcd_hz * static_cast<uint32_t>(d);
        for (uint8_t r = 2; r <= 7; ++r) {
            const uint32_t vco = r_out * r;
            if (vco < pll_vco_min_hz || vco > pll_vco_max_hz || vco % in != 0u) {
                continue;
            }
            const uint32_t n = vco / in;
            if (n < 50u || n > 432u) {
                continue;
            }
            uint8_t q = 2;
            while (q < 15 && vco / q > pll_q_domain_max_hz) {
                ++q;
            }
            return LcdClockConfig{PllSaiConfig{static_cast<uint16_t>(n), q, r}, d};
        }
    }
    return LcdClockConfig{};
}

