uliano/brio/brio/stm32f4/clock.hpp
/// What the I2S kernel clock may be taken from. Which of the four a part
/// offers is `i2s_clock_select()`'s (stm32f4/device_tables.hpp): the parts
/// with RCC_CFGR.I2SSRC have the first two, the parts with the
/// RCC_DCKCFGR pair have all four.
enum class I2sSource : uint8_t {
    plli2s_r = 0,   ///< the audio PLL's R output
    ckin = 1,       ///< the I2S_CKIN pad, an external audio clock
    pll_r = 2,      ///< the MAIN PLL's R output
    root = 3,       ///< HSI or HSE, whichever PLLCFGR.PLLSRC names
};

/// The smallest power-of-two APB division (1, 2, 4, 8, 16) that keeps
/// `hclk / div` at or below `ceiling`; 0 when none does.
constexpr uint8_t apb_divider_for(uint32_t hclk, uint32_t ceiling) {
    for (uint8_t div = 1; div <= 16; div = static_cast<uint8_t>(div * 2)) {
        if (hclk / div <= ceiling) {
            return div;
        }
    }
    return 0;
}

/// RCC_CFGR.PPREx encoding of a divider (7.3.3): 0xx for 1, 100 for 2,
/// 101 for 4, 110 for 8, 111 for 16.
constexpr uint8_t ppre_code(uint8_t div) {
    switch (div) {
        case 1: return 0;
        case 2: return 4;
        case 4: return 5;
        case 8: return 6;
        case 16: return 7;
        default: return 0;
    }
}

/// The regulator scale `hclk` needs on this part - the lowest scale
/// whose ceiling covers it, over-drive counted where the part has it -
/// and whether over-drive is needed. `scale == scale3` with `known ==
/// false` means the ladder does not reach it.
struct RateRegime {
    bool known = false;
    VoltageScale scale = VoltageScale::scale3;
    bool over_drive = false;
};

constexpr RateRegime regime_for(uint32_t hclk) {
    constexpr SysclkLadder l = sysclk_ladder();
    RateRegime r{};
    if (!l.known) {
        return r;
    }
    if (l.scale3_hz != 0u && hclk <= l.scale3_hz) {
        return RateRegime{true, VoltageScale::scale3, false};
    }
    if (hclk <= l.scale2_hz) {
        return RateRegime{true, VoltageScale::scale2, false};
    }
    if (hclk <= l.scale1_hz) {
        return RateRegime{true, VoltageScale::scale1, false};
    }
    if (l.od_scale1_hz != 0u && hclk <= l.od_scale1_hz) {
        return RateRegime{true, VoltageScale::scale1, true};
    }
    return r;
}

// ---- the RCC resource -----------------------------------------------------------

/// The reset and clock control block as a monostate resource.
struct Rcc {
    Rcc() = delete;

    /// Bounded waits on a ready flag: the HSI is ready in microseconds,
    /// a crystal in up to a couple of milliseconds, the PLL in hundreds
    /// of microseconds; a million iterations at the 16 MHz reset rate is
    /// hundreds of milliseconds - a hardware fault, not a slow start.
    static constexpr uint32_t ready_spins = 1'000'000u;

    // ---- HSI (7.3.1) --------------------------------------------------------------
    static void hsi_enable(bool on) { bit(RCC->CR, RCC_CR_HSION, on); }
    static bool hsi_ready() { return (RCC->CR & RCC_CR_HSIRDY) != 0u; }
    static bool hsi_wait_ready() { return wait(RCC->CR, RCC_CR_HSIRDY, true); }

    // ---- HSE (7.3.1): crystal or bypassed clock ---------------------------------
    /// HSEBYP is written before HSEON (7.3.1: bypass "can be written
    /// only if the HSE oscillator is disabled").
    static void hse_enable(bool on, bool bypass) {
        if (on) {
            bit(RCC->CR, RCC_CR_HSEBYP, bypass);
            RCC->CR |= RCC_CR_HSEON;
        } else {
            RCC->CR &= ~RCC_CR_HSEON;
        }
    }
    static bool hse_ready() { return (RCC->CR & RCC_CR_HSERDY) != 0u; }
    static bool hse_wait_ready() { return wait(RCC->CR, RCC_CR_HSERDY, true); }
    static bool hse_bypassed() { return (RCC->CR & RCC_CR_HSEBYP) != 0u; }

    /// The clock security system on the HSE (7.2.7): an HSE failure then
    /// switches SYSCLK to HSI and raises the CSS interrupt on the NMI.
    static void css(bool on) { bit(RCC->CR, RCC_CR_CSSON, on); }

    // ---- LSI (7.2.8, 7.3.21): the low-speed RC, 32 kHz nominal -----------------
    //
    // Not a SYSCLK root and not a Clock task's business: this oscillator
    // is what the independent watchdog counts and what the RTC may run
    // on, so the verbs live here (the block's owner) and the chapters
    // above call them. IT SITS IN RCC_CSR, whose top eight bits are the
    // RESET FLAGS (stm32f4/reset.hpp): every write here is a
    // read-modify-write that leaves them alone, which is safe because
    // RMVF reads as zero and writing zero to it has no effect.
    //
    // LSIRDY is not a witness of LSION alone: a started IWDG forces the
    // oscillator on (7.2.9) and so does an RTC whose clock select names
    // it, and neither sets LSION.
    static void lsi_enable(bool on) { bit(RCC->CSR, RCC_CSR_LSION, on); }
    static bool lsi_enabled() { return (RCC->CSR & RCC_CSR_LSION) != 0u; }
    static bool lsi_ready() { return (RCC->CSR & RCC_CSR_LSIRDY) != 0u; }
    static bool lsi_wait_ready() { return wait(RCC->CSR, RCC_CSR_LSIRDY, true); }

    // ---- the main PLL (7.3.2) -------------------------------------------------------
    static void pll_enable(bool on) { bit(RCC->CR, RCC_CR_PLLON, on); }
    static bool pll_ready() { return (RCC->CR & RCC_CR_PLLRDY) != 0u; }
    static bool pll_wait(bool ready) { return wait(RCC->CR, RCC_CR_PLLRDY, ready); }

    /// Write PLLCFGR from a configuration. Refused (false, nothing
    /// written) while the PLL is on - 7.3.2 allows the write only then -
    /// or when the config is empty. The R field, where the header has
    /// one (the F446's I2S/SAI/SPDIF divider), is written at its reset
    /// value 2; the reserved top bits elsewhere are kept.
    static bool pll_configure(const PllConfig& c) {
        if (c.m == 0u || (RCC->CR & RCC_CR_PLLON) != 0u) {
            return false;
        }
        uint32_t v = (static_cast<uint32_t>(c.m) << RCC_PLLCFGR_PLLM_Pos) |
                     (static_cast<uint32_t>(c.n) << RCC_PLLCFGR_PLLN_Pos) |
                     (static_cast<uint32_t>((c.p >> 1) - 1u) << RCC_PLLCFGR_PLLP_Pos) |
                     (static_cast<uint32_t>(c.q) << RCC_PLLCFGR_PLLQ_Pos) |
                     (c.from_hse ? RCC_PLLCFGR_PLLSRC_HSE : 0u);
#if defined(RCC_PLLCFGR_PLLR)
        v |= 2u << RCC_PLLCFGR_PLLR_Pos;
#else
        v |= RCC->PLLCFGR & 0xF0000000u;
#endif
        RCC->PLLCFGR = v;
        return true;
    }

    // ---- the audio PLL (7.3.23) and the I2S clock select (7.3.3, 6.3.24) -------------
    //
    // A SECOND PLL off the SAME root as the main one (PLLCFGR.PLLSRC picks
    // HSI or HSE for both), whose R output is what an I2S divides. It is
    // the I2S chapter's clock and nothing else's here, so the verbs sit
    // with the block that owns the registers and stm32f4/spi.hpp calls
    // them. Absent on the parts whose header declares no PLLI2SON, where
    // every verb below answers false and writes nothing.
    static void plli2s_enable(bool on) {
#if defined(RCC_CR_PLLI2SON)
        bit(RCC->CR, RCC_CR_PLLI2SON, on);
#else
        (void)on;
#endif
    }
    static bool plli2s_ready() {
#if defined(RCC_CR_PLLI2SRDY)
        return (RCC->CR & RCC_CR_PLLI2SRDY) != 0u;
#else
        return false;
#endif
    }
    static bool plli2s_wait(bool ready) {
#if defined(RCC_CR_PLLI2SRDY)
        return wait(RCC->CR, RCC_CR_PLLI2SRDY, ready);
#else
        return !ready;
#endif
    }

    /// Write PLLI2SCFGR from a configuration. Refused (false, nothing
    /// written) while the audio PLL is on - the chapter allows the write
    /// only then - when the configuration is empty, and when the part has
    /// an input divider of its own but the caller named none. The fields
    /// the header does not declare are not written: on the F42x/F43x class
    /// there is no M (the main PLL's is used) and no P.
    static bool plli2s_configure(const PllI2sConfig& c) {
#if defined(RCC_CR_PLLI2SON)
        if (c.n == 0u || c.r == 0u || (RCC->CR & RCC_CR_PLLI2SON) != 0u) {
            return false;
        }
        if (plli2s_has_m() != (c.m != 0u)) {
            return false;
        }
        uint32_t v = (static_cast<uint32_t>(c.n) << RCC_PLLI2SCFGR_PLLI2SN_Pos) |
                     (static_cast<uint32_t>(c.r) << RCC_PLLI2SCFGR_PLLI2SR_Pos);
#if defined(RCC_PLLI2SCFGR_PLLI2SM_Pos)
        v |= static_cast<uint32_t>(c.m) << RCC_PLLI2SCFGR_PLLI2SM_Pos;
#endif
#if defined(RCC_PLLI2SCFGR_PLLI2SQ_Pos)
        v |= static_cast<uint32_t>(c.q == 0u ? 2u : c.q) << RCC_PLLI2SCFGR_PLLI2SQ_Pos;
#endif
#if defined(RCC_PLLI2SCFGR_PLLI2SP_Pos)
        v |= static_cast<uint32_t>(((c.p == 0u ? 2u : c.p) >> 1) - 1u) << RCC_PLLI2SCFGR_PLLI2SP_Pos;
#endif
        RCC->PLLI2SCFGR = v;
        return true;
#else
        (void)c;
        return false;
#endif
    }

    /// What PLLI2SCFGR holds now (m stays 0 where the part has no PLLI2SM).
    static PllI2sConfig plli2s_config() {
        PllI2sConfig c{};
#if defined(RCC_CR_PLLI2SON)
        const uint32_t v = RCC->PLLI2SCFGR;
        c.n = static_cast<uint16_t>((v & RCC_PLLI2SCFGR_PLLI2SN_Msk) >> RCC_PLLI2SCFGR_PLLI2SN_Pos);
        c.r = static_cast<uint8_t>((v & RCC_PLLI2SCFGR_PLLI2SR_Msk) >> RCC_PLLI2SCFGR_PLLI2SR_Pos);
#if defined(RCC_PLLI2SCFGR_PLLI2SM_Pos)
        c.m = static_cast<uint8_t>((v & RCC_PLLI2SCFGR_PLLI2SM_Msk) >> RCC_PLLI2SCFGR_PLLI2SM_Pos);
#endif
#if defined(RCC_PLLI2SCFGR_PLLI2SQ_Pos)
        c.q = static_cast<uint8_t>((v & RCC_PLLI2SCFGR_PLLI2SQ_Msk) >> RCC_PLLI2SCFGR_PLLI2SQ_Pos);
#endif
#if defined(RCC_PLLI2SCFGR_PLLI2SP_Pos)
        c.p = static_cast<uint8_t>(
            (((v & RCC_PLLI2SCFGR_PLLI2SP_Msk) >> RCC_PLLI2SCFGR_PLLI2SP_Pos) + 1u) * 2u);
#endif
#endif
        return c;
    }

    /// The main PLL's own input divider, for the parts whose audio PLL
    /// shares it.
    static uint8_t pll_m() {
        return static_cast<uint8_t>((RCC->PLLCFGR & RCC_PLLCFGR_PLLM_Msk) >> RCC_PLLCFGR_PLLM_Pos);
    }

    /// Point an I2S kernel clock at a source. `on_apb2` names WHICH
    /// selector on a part with the RCC_DCKCFGR pair, where the numbering
    /// is by BUS: I2S1SRC serves the APB1 instances and I2S2SRC the APB2
    /// ones. On a part with RCC_CFGR.I2SSRC there is one selector for
    /// every instance and the argument is ignored; only `plli2s_r` and
    /// `ckin` exist there, and the other two are refused. Refused whole
    /// where the part's selector is one this stratum has not read
    /// (`I2sClockSelect::dckcfgr_one`, the F410's four codes) or has none.
    static bool i2s_source(I2sSource s, bool on_apb2 = false) {
#if defined(RCC_DCKCFGR_I2S1SRC)
        const uint32_t code = static_cast<uint32_t>(s);
        if (on_apb2) {
            RCC->DCKCFGR = (RCC->DCKCFGR & ~RCC_DCKCFGR_I2S2SRC_Msk) |
                           (code << RCC_DCKCFGR_I2S2SRC_Pos);
        } else {
            RCC->DCKCFGR = (RCC->DCKCFGR & ~RCC_DCKCFGR_I2S1SRC_Msk) |
                           (code << RCC_DCKCFGR_I2S1SRC_Pos);
        }
        return true;
#elif defined(RCC_CFGR_I2SSRC)
        (void)on_apb2;
        if (s != I2sSource::plli2s_r && s != I2sSource::ckin) {
            return false;
        }
        bit(RCC->CFGR, RCC_CFGR_I2SSRC, s == I2sSource::ckin);
        return true;
#else
        (void)s;
        (void)on_apb2;
        return false;
#endif
    }

    static I2sSource i2s_source(bool on_apb2 = false) {
#if defined(RCC_DCKCFGR_I2S1SRC)
        const uint32_t v = RCC->DCKCFGR;
        const uint32_t code = on_apb2 ? ((v & RCC_DCKCFGR_I2S2SRC_Msk) >> RCC_DCKCFGR_I2S2SRC_Pos)
                                      : ((v & RCC_DCKCFGR_I2S1SRC_Msk) >> RCC_DCKCFGR_I2S1SRC_Pos);
        return static_cast<I2sSource>(code);
#elif defined(RCC_CFGR_I2SSRC)
        (void)on_apb2;
        return (RCC->CFGR & RCC_CFGR_I2SSRC) != 0u ? I2sSource::ckin : I2sSource::plli2s_r;
#else
        (void)on_apb2;
        return I2sSource::plli2s_r;
#endif
    }

    // ---- the third PLL and the pixel clock (6.3.24, 6.3.25) --------------------------
    //
    // PLLSAI sits beside the audio PLL on the same root and the same
    // PLLM, and its R output over DCKCFGR.PLLSAIDIVR is LCD_CLK - the
    // one clock the display controller counts pixels on. The verbs sit
    // with the block that owns the registers, as the audio PLL's do, and
    // stm32f4/ltdc.hpp is what calls them. Absent where the header
    // declares no PLLSAION, and the R half absent again on the part that
    // has this PLL for its audio interface alone: every verb below then
    // answers false and writes nothing.
    static void pllsai_enable(bool on) {
#if defined(RCC_CR_PLLSAION)
        bit(RCC->CR, RCC_CR_PLLSAION, on);
#else
        (void)on;
#endif
    }
    static bool pllsai_ready() {
#if defined(RCC_CR_PLLSAIRDY)
        return (RCC->CR & RCC_CR_PLLSAIRDY) != 0u;
#else
        return false;
#endif
    }
    static bool pllsai_wait(bool ready) {
#if defined(RCC_CR_PLLSAIRDY)
        return wait(RCC->CR, RCC_CR_PLLSAIRDY, ready);
#else
        return !ready;
#endif
    }

    /// Write PLLSAICFGR from a configuration. Refused (false, nothing
    /// written) while the PLL is on - 6.3.24 allows the write only then -
    /// when N is out of the chapter's 50..432, and when R is asked for on
    /// a part whose PLL has no R output.
    static bool pllsai_configure(const PllSaiConfig& c) {
#if defined(RCC_CR_PLLSAION)
        if (c.n < 50u || c.n > 432u || (RCC->CR & RCC_CR_PLLSAION) != 0u) {
            return false;
        }
        if (c.r != 0u && (c.r < 2u || c.r > 7u)) {
            return false;
        }
        if (c.r != 0u && !pllsai_has_r()) {
            return false;
        }
        uint32_t v = static_cast<uint32_t>(c.n) << RCC_PLLSAICFGR_PLLSAIN_Pos;
#if defined(RCC_PLLSAICFGR_PLLSAIQ_Pos)
        v |= static_cast<uint32_t>(c.q == 0u ? 2u : c.q) << RCC_PLLSAICFGR_PLLSAIQ_Pos;
#endif
#if defined(RCC_PLLSAICFGR_PLLSAIR_Pos)
        v |= static_cast<uint32_t>(c.r == 0u ? 2u : c.r) << RCC_PLLSAICFGR_PLLSAIR_Pos;
#endif
        RCC->PLLSAICFGR = v;
        return true;
#else
        (void)c;
        return false;
#endif
    }

    /// What PLLSAICFGR holds now (r stays 0 where the part has no R
    /// output).
    static PllSaiConfig pllsai_config() {
        PllSaiConfig c{};
#if defined(RCC_CR_PLLSAION)
        const uint32_t v = RCC->PLLSAICFGR;
        c.n = static_cast<uint16_t>((v & RCC_PLLSAICFGR_PLLSAIN_Msk) >> RCC_PLLSAICFGR_PLLSAIN_Pos);
#if defined(RCC_PLLSAICFGR_PLLSAIQ_Pos)
        c.q = static_cast<uint8_t>((v & RCC_PLLSAICFGR_PLLSAIQ_Msk) >> RCC_PLLSAICFGR_PLLSAIQ_Pos);
#endif
#if defined(RCC_PLLSAICFGR_PLLSAIR_Pos)
        c.r = static_cast<uint8_t>((v & RCC_PLLSAICFGR_PLLSAIR_Msk) >> RCC_PLLSAICFGR_PLLSAIR_Pos);
#endif
#endif
        return c;
    }

    /// RCC_DCKCFGR.PLLSAIDIVR, the last division on the way to LCD_CLK.
    /// 6.3.25 asks for it to be written with the PLL off, which is
    /// refused here rather than trusted.
    static bool lcd_clock_divider(LcdClockDivider d) {
#if defined(RCC_DCKCFGR_PLLSAIDIVR)
        if ((RCC->CR & RCC_CR_PLLSAION) != 0u) {
            return false;
        }
        RCC->DCKCFGR = (RCC->DCKCFGR & ~RCC_DCKCFGR_PLLSAIDIVR_Msk) |
                       (static_cast<uint32_t>(lcd_divider_code(d)) << RCC_DCKCFGR_PLLSAIDIVR_Pos);
        return true;
#else
        (void)d;
        return false;
#endif
    }

    static LcdClockDivider lcd_clock_divider() {
#if defined(RCC_DCKCFGR_PLLSAIDIVR)
        switch ((RCC->DCKCFGR & RCC_DCKCFGR_PLLSAIDIVR_Msk) >> RCC_DCKCFGR_PLLSAIDIVR_Pos) {
            case 0: return LcdClockDivider::div2;
            case 1: return LcdClockDivider::div4;
            case 2: return LcdClockDivider::div8;
            default: return LcdClockDivider::div16;
        }
#else
        return LcdClockDivider::div2;
#endif
    }

    /**
     * The FMPI2C1 kernel-clock multiplexer, on the parts that carry that
     * block: RCC_DCKCFGR2's FMPI2C1SEL (RM0390 6.3.27, where ST spells the
     * field "I2C4 kernel clock source selection" - I2C4 and FMPI2C1 being
     * one peripheral under two names, ES0298 2.12.10).
     *
     * `code` is the field's own: 0 the peripheral's APB clock, 1 SYSCLK, 2
     * the HSI, 3 the APB clock again ("same as 00"). Two bits, so no code
     * is refused here; what a driver may name is its own enum's business
     * (stm32f4/fmpi2c.hpp's FmpI2cClock). False - nothing written - on a
     * part with no such peripheral.
     */
    static bool fmpi2c_kernel_clock(uint8_t code) {
#if defined(RCC_DCKCFGR2_FMPI2C1SEL)
        RCC->DCKCFGR2 = (RCC->DCKCFGR2 & ~RCC_DCKCFGR2_FMPI2C1SEL_Msk) |
                        ((static_cast<uint32_t>(code) & 0x3u) << RCC_DCKCFGR2_FMPI2C1SEL_Pos);
        return true;
#else
        (void)code;
        return false;
#endif
    }

    static uint8_t fmpi2c_kernel_clock() {
#if defined(RCC_DCKCFGR2_FMPI2C1SEL)
        return static_cast<uint8_t>((RCC->DCKCFGR2 & RCC_DCKCFGR2_FMPI2C1SEL_Msk) >>
                                    RCC_DCKCFGR2_FMPI2C1SEL_Pos);
#else
        return 0;
#endif
    }

