uliano/brio/brio/stm32f4/clock.hpp
    // ---- SYSCLK (7.3.3) --------------------------------------------------------------
    static void sysclk_select(SysclkSource s) {
        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW_Msk) | (static_cast<uint32_t>(s) << RCC_CFGR_SW_Pos);
    }
    static SysclkSource sysclk_status() {
        return static_cast<SysclkSource>((RCC->CFGR & RCC_CFGR_SWS_Msk) >> RCC_CFGR_SWS_Pos);
    }
    static bool sysclk_wait(SysclkSource s) {
        for (uint32_t spins = 0; spins < ready_spins; ++spins) {
            if (sysclk_status() == s) {
                return true;
            }
        }
        return false;
    }

    // ---- the bus prescalers (7.3.3) ----------------------------------------------------
    /// HPRE at 1 (0xxx), PPRE1 and PPRE2 from their dividers. A divider
    /// ppre_code() does not know is written as 1.
    static void bus_prescalers(uint8_t apb1_div, uint8_t apb2_div) {
        RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE_Msk | RCC_CFGR_PPRE1_Msk | RCC_CFGR_PPRE2_Msk)) |
                    (static_cast<uint32_t>(ppre_code(apb1_div)) << RCC_CFGR_PPRE1_Pos) |
                    (static_cast<uint32_t>(ppre_code(apb2_div)) << RCC_CFGR_PPRE2_Pos);
    }
    static uint8_t apb1_divider() { return divider_of((RCC->CFGR & RCC_CFGR_PPRE1_Msk) >> RCC_CFGR_PPRE1_Pos); }
    static uint8_t apb2_divider() { return divider_of((RCC->CFGR & RCC_CFGR_PPRE2_Msk) >> RCC_CFGR_PPRE2_Pos); }
    static bool ahb_undivided() { return (RCC->CFGR & RCC_CFGR_HPRE_3) == 0u; }

    // ---- RCC_DCKCFGR.TIMPRE (7.3.24) -----------------------------------------------
    /// THE TIMERS' OWN PRESCALER RULE, and the one thing in this block
    /// that is not the timers' chapter's: a timer counts HCLK when its APB
    /// prescaler is 1, and TWICE its APB clock when it is divided - unless
    /// this bit is set, and then it counts HCLK at a prescaler of 1 OR 2
    /// and four times PCLK beyond. Clear out of reset, and absent
    /// altogether on the F405/F407/F415/F417 headers, where the reader
    /// answers false and the setter writes nothing. What the bit means for
    /// a given instance is stm32f4/tim.hpp's `tim_clock_hz()`.
    static void timpre(bool on) {
#if defined(RCC_DCKCFGR_TIMPRE)
        bit(RCC->DCKCFGR, RCC_DCKCFGR_TIMPRE, on);
#else
        (void)on;
#endif
    }
    static bool timpre() {
#if defined(RCC_DCKCFGR_TIMPRE)
        return (RCC->DCKCFGR & RCC_DCKCFGR_TIMPRE) != 0u;
#else
        return false;
#endif
    }

    // ---- MCO (7.3.3): the two clock outputs -------------------------------------------
    /// MCO1 on PA8: 00 HSI, 01 LSE, 10 HSE, 11 PLL; the prescaler 1..5
    /// (codes 0xx = 1, 100..111 = 2..5). The pad is the caller's.
    static bool mco1(uint8_t source_code, uint8_t div) {
        if (source_code > 3u || div == 0u || div > 5u) {
            return false;
        }
        const uint32_t pre = div == 1u ? 0u : (4u + (div - 2u));
        RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_MCO1_Msk | RCC_CFGR_MCO1PRE_Msk)) |
                    (static_cast<uint32_t>(source_code) << RCC_CFGR_MCO1_Pos) |
                    (pre << RCC_CFGR_MCO1PRE_Pos);
        return true;
    }
    /// MCO2 on PC9: 00 SYSCLK, 01 PLLI2S, 10 HSE, 11 PLL; the same
    /// prescaler. The F410/F412 class has MCO1 alone, and the header
    /// says so by declaring no MCO2 field.
#if defined(RCC_CFGR_MCO2)
    static bool mco2(uint8_t source_code, uint8_t div) {
        if (source_code > 3u || div == 0u || div > 5u) {
            return false;
        }
        const uint32_t pre = div == 1u ? 0u : (4u + (div - 2u));
        RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_MCO2_Msk | RCC_CFGR_MCO2PRE_Msk)) |
                    (static_cast<uint32_t>(source_code) << RCC_CFGR_MCO2_Pos) |
                    (pre << RCC_CFGR_MCO2PRE_Pos);
        return true;
    }
#endif
    static constexpr uint8_t mco1_hsi_code = 0;
    static constexpr uint8_t mco1_lse_code = 1;
    static constexpr uint8_t mco1_hse_code = 2;
    static constexpr uint8_t mco1_pll_code = 3;
    static constexpr uint8_t mco2_sysclk_code = 0;
    static constexpr uint8_t mco2_hse_code = 2;
    static constexpr uint8_t mco2_pll_code = 3;

    // ---- peripheral clock enables (7.3.10 .. 7.3.14) and resets (7.3.5 .. 7.3.9) ------
    /// Each enable verb reads its register back: the dummy access ES0206
    /// 2.2.7 asks for between the enable and the first register write.
    static void io_clock(char port, bool on) {
        bit(RCC->AHB1ENR, gpio_port_clock_mask(port), on);
        (void)RCC->AHB1ENR;
    }
    static bool io_clock(char port) {
        const uint32_t m = gpio_port_clock_mask(port);
        return m != 0u && (RCC->AHB1ENR & m) == m;
    }
    static void ahb1_clock(uint32_t mask, bool on) { bit(RCC->AHB1ENR, mask, on); (void)RCC->AHB1ENR; }
    static bool ahb1_clock(uint32_t mask) { return (RCC->AHB1ENR & mask) == mask; }
    // AHB2 and AHB3 exist where the header declares an enable bit on
    // them (the F410 has neither bus; the F401/F411 have AHB2 for the
    // OTG FS alone; AHB3 carries the external memory controller and, on
    // the F446, the QUADSPI): the guards ask the header, as the reserve's
    // rule wants a presence question asked.
#if defined(RCC_AHB2ENR_OTGFSEN) || defined(RCC_AHB2ENR_DCMIEN) || defined(RCC_AHB2ENR_RNGEN)
    static void ahb2_clock(uint32_t mask, bool on) { bit(RCC->AHB2ENR, mask, on); (void)RCC->AHB2ENR; }
    static bool ahb2_clock(uint32_t mask) { return (RCC->AHB2ENR & mask) == mask; }
    static void ahb2_reset(uint32_t mask) { RCC->AHB2RSTR |= mask; RCC->AHB2RSTR &= ~mask; }
#endif
#if defined(RCC_AHB3ENR_FMCEN) || defined(RCC_AHB3ENR_FSMCEN) || defined(RCC_AHB3ENR_QSPIEN)
    static void ahb3_clock(uint32_t mask, bool on) { bit(RCC->AHB3ENR, mask, on); (void)RCC->AHB3ENR; }
    static bool ahb3_clock(uint32_t mask) { return (RCC->AHB3ENR & mask) == mask; }
    static void ahb3_reset(uint32_t mask) { RCC->AHB3RSTR |= mask; RCC->AHB3RSTR &= ~mask; }
#endif
    static void apb1_clock(uint32_t mask, bool on) { bit(RCC->APB1ENR, mask, on); (void)RCC->APB1ENR; }
    static bool apb1_clock(uint32_t mask) { return (RCC->APB1ENR & mask) == mask; }
    static void apb2_clock(uint32_t mask, bool on) { bit(RCC->APB2ENR, mask, on); (void)RCC->APB2ENR; }
    static bool apb2_clock(uint32_t mask) { return (RCC->APB2ENR & mask) == mask; }

