uliano/brio/brio/stm32f4/clock.hpp
    /// Pulse a peripheral's reset line: every register of the block to
    /// its reset value, the bus clock untouched.
    static void ahb1_reset(uint32_t mask) { RCC->AHB1RSTR |= mask; RCC->AHB1RSTR &= ~mask; }
    static void apb1_reset(uint32_t mask) { RCC->APB1RSTR |= mask; RCC->APB1RSTR &= ~mask; }
    static void apb2_reset(uint32_t mask) { RCC->APB2RSTR |= mask; RCC->APB2RSTR &= ~mask; }

private:
    static void bit(volatile uint32_t& r, uint32_t mask, bool on) {
        if (on) {
            r |= mask;
        } else {
            r &= ~mask;
        }
    }
    static bool wait(volatile uint32_t& r, uint32_t mask, bool set) {
        for (uint32_t spins = 0; spins < ready_spins; ++spins) {
            if (((r & mask) != 0u) == set) {
                return true;
            }
        }
        return false;
    }
    static uint8_t divider_of(uint32_t code) {
        return code < 4u ? 1u : static_cast<uint8_t>(2u << (code - 4u));
    }
};

// ---- the clock TASK -------------------------------------------------------------------

/// The root a Clock task runs SYSCLK from.
enum class ClockSource : uint8_t {
    hsi,        ///< HSI undivided: 16 MHz, the reset state
    hse,        ///< the HSE root undivided (crystal or bypass)
    pll_hsi,    ///< the main PLL fed by HSI
    pll_hse,    ///< the main PLL fed by HSE
};

/// How the HSE pins are used: a crystal between OSC_IN and OSC_OUT, or
/// an external clock into OSC_IN (HSEBYP).
enum class HseMode : uint8_t { crystal, bypass };

inline constexpr uint32_t hsi_hz = 16'000'000u;
inline constexpr uint32_t hse_crystal_min_hz = 4'000'000u;
inline constexpr uint32_t hse_crystal_max_hz = 26'000'000u;
inline constexpr uint32_t hse_bypass_min_hz = 1'000'000u;
inline constexpr uint32_t hse_bypass_max_hz = 50'000'000u;

/// THE APB DIVIDER RULE, in one place: the smallest power-of-two division
/// that keeps a bus under its ceiling, and 1 at or below the 16 MHz reset
/// rate (where no ladder is consulted, so a part whose ceilings the
/// reserve does not know still runs). `Clock` folds it into `apb1_div` and
/// `apb2_div`; a driver rebased by the dynamic clock below calls it with
/// the NEW rate, because the RCC still holds the old divider at that
/// moment.
constexpr uint8_t apb_divider_at(uint32_t hclk, bool on_apb2) {
    if (hclk <= hsi_hz) {
        return 1;
    }
    constexpr SysclkLadder l = sysclk_ladder();
    return apb_divider_for(hclk, on_apb2 ? l.apb2_max_hz : l.apb1_max_hz);
}

/// The bus rate that follows from it. Zero where no divider keeps the bus
/// in range, which `Clock`'s own static_assert refuses at compile time.
constexpr uint32_t apb_hz_at(uint32_t hclk, bool on_apb2) {
    const uint8_t div = apb_divider_at(hclk, on_apb2);
    return div == 0u ? 0u : hclk / div;
}

/**
 * Clock<source, hz, hse_hz, hse_mode>: the static main clock.
 *
 *   using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000,
 *                                8'000'000, brio::HseMode::bypass>;
 *   constexpr SysClock clock;
 *   SysClock::init();                 // false: a root did not come up
 *
 * `hz` is SYSCLK = HCLK; `pclk1_hz` and `pclk2_hz` the two APB rates the
 * task derives; `usb_hz` what the PLL's Q output gives (0 without the
 * PLL). All constexpr, so every divisor built from them folds.
 */
template <ClockSource src, uint32_t sys_hz, uint32_t hse_hz = 0, HseMode hse_mode = HseMode::crystal>
struct Clock {
    static constexpr ClockSource source = src;
    static constexpr uint32_t hz = sys_hz;
    static constexpr bool is_static = true;

    static constexpr bool uses_hse = src == ClockSource::hse || src == ClockSource::pll_hse;
    static constexpr bool uses_pll = src == ClockSource::pll_hsi || src == ClockSource::pll_hse;
    static constexpr uint32_t root_hz = uses_hse ? hse_hz : hsi_hz;

    static_assert(!uses_hse || hse_hz != 0u,
                  "brio Clock: an HSE root needs its rate as the third argument");
    static_assert(!uses_hse || hse_mode == HseMode::bypass ||
                      (hse_hz >= hse_crystal_min_hz && hse_hz <= hse_crystal_max_hz),
                  "brio Clock: an HSE crystal is 4..26 MHz on this family (the datasheets)");
    static_assert(!uses_hse || hse_mode == HseMode::crystal ||
                      (hse_hz >= hse_bypass_min_hz && hse_hz <= hse_bypass_max_hz),
                  "brio Clock: a bypassed HSE clock is 1..50 MHz on this family (the datasheets)");
    static_assert(src != ClockSource::hsi || sys_hz == hsi_hz,
                  "brio Clock: the hsi root runs 16 MHz undivided - the AHB prescaler is "
                  "declared and not built");
    static_assert(src != ClockSource::hse || sys_hz == hse_hz,
                  "brio Clock: the hse root runs the HSE rate undivided");

    static constexpr PllConfig pll = uses_pll ? pll_config_for(root_hz, sys_hz, src == ClockSource::pll_hse)
                                              : PllConfig{};
    static_assert(!uses_pll || pll.m != 0u,
                  "brio Clock: no exact PLL ratio for this rate (RM0090 7.3.2: input / M "
                  "in 1..2 MHz, VCO in 100..432 MHz, N in 50..432, P in {2, 4, 6, 8})");

    /// The Q output (USB OTG FS, SDIO, RNG): 48 MHz when the ratio has it.
    static constexpr uint32_t usb_hz = uses_pll ? (root_hz / pll.m) * pll.n / pll.q : 0u;

    /// A rate at or below the 16 MHz reset rate runs as the reset state
    /// does - scale untouched, zero wait states, undivided buses - on any
    /// root and any header; only a rate above it needs the part's ladder.
    static constexpr bool needs_ladder = sys_hz > hsi_hz;

    static constexpr RateRegime regime = regime_for(sys_hz);
    static_assert(!needs_ladder || regime.known,
                  "brio Clock: this rate is above what the reserve's ladder knows for this "
                  "part (stm32f4/device_tables.hpp: the ladders read are the F405, F42x/F43x, "
                  "F446 and F411 classes'), or above the part's ceiling");
    static constexpr uint8_t wait_states = needs_ladder ? flash_wait_states_for(sys_hz) : 0u;
    static_assert(wait_states != 0xFFu, "brio Clock: no wait-state band for this rate");

    static constexpr SysclkLadder ladder = sysclk_ladder();
    static constexpr uint8_t apb1_div = apb_divider_at(sys_hz, false);
    static constexpr uint8_t apb2_div = apb_divider_at(sys_hz, true);
    static_assert(apb1_div != 0u && apb2_div != 0u, "brio Clock: no APB divider keeps the buses in range");

