uliano/brio/brio/stm32f4/clock.hpp
    /// The two APB rates, the ones a peripheral's divisor divides.
    static constexpr uint32_t pclk1_hz = sys_hz / apb1_div;
    static constexpr uint32_t pclk2_hz = sys_hz / apb2_div;

    static constexpr SysclkSource sysclk_source =
        src == ClockSource::hsi ? SysclkSource::hsi
                                : (src == ClockSource::hse ? SysclkSource::hse : SysclkSource::pll);

    /// Bring the tree to the named rate, from the reset state. False, and
    /// the tree left where it stopped, when a root does not come up or a
    /// readback does not agree.
    static bool init() {
        if constexpr (uses_hse) {
            Rcc::hse_enable(true, hse_mode == HseMode::bypass);
            if (!Rcc::hse_wait_ready()) {
                return false;
            }
        }
        if constexpr (src == ClockSource::hsi) {
            // The reset state: HSI on, SYSCLK = HSI, 0 wait states. The
            // accelerator is switched on all the same: it costs nothing
            // and a program that measures a rate deserves the same flash
            // behaviour at every one.
            FlashAccel::enable_all();
            return Rcc::sysclk_status() == SysclkSource::hsi;
        }
        if constexpr (uses_pll) {
            // 1. the regulator scale, PLL off, SYSCLK on HSI (kept at its
            // reset value for a rate the reset state already serves).
            if constexpr (needs_ladder) {
                if (!Pwr::scale(regime.scale)) {
                    return false;
                }
            }
            // 2. the PLL.
            if (!Rcc::pll_configure(pll)) {
                return false;
            }
            Rcc::pll_enable(true);
            if constexpr (regime.over_drive) {
                if (!Pwr::over_drive_enter()) {
                    return false;
                }
            }
        }
        // 3. the flash first, then the buses, then the switch.
        if (!FlashWaitStates::set(wait_states)) {
            return false;
        }
        FlashAccel::enable_all();
        Rcc::bus_prescalers(apb1_div, apb2_div);
        if constexpr (uses_pll) {
            if (!Rcc::pll_wait(true)) {
                return false;
            }
        }
        Rcc::sysclk_select(sysclk_source);
        return Rcc::sysclk_wait(sysclk_source);
    }
};

/// The rate a peripheral on an APB really runs at: pclk2 for the APB2
/// instances, pclk1 for the rest. Folds for a static clock.
template <typename C>
constexpr uint32_t apb_hz(C, bool on_apb2) {
    if constexpr (C::is_static) {
        return on_apb2 ? C::pclk2_hz : C::pclk1_hz;
    } else {
        return on_apb2 ? C::pclk2_hz() : C::pclk1_hz();
    }
}

// ---- the dynamic clock ---------------------------------------------------------------

/// The pack of rates a DynamicClock may run at: static Clock tasks, the
/// FIRST the boot rate. A type list and nothing else - the discrete set on
/// this family is the program's own choice of tuples (below).
template <typename... Rs>
struct Rates {
    static constexpr uint8_t count = sizeof...(Rs);
};

/**
 * The runtime regime: `Rates<R0, R1, ...>` names the rates - each a static
 * `Clock<source, hz, hse_hz, hse_mode>`, R0 the boot rate - and Users the
 * drivers a switch fans the new rate out to (each a ClockUser: `static void
 * rebase(uint32_t hz)`, checked by the concept where the list is written)
 * IN LIST ORDER, synchronously, BEFORE anything moves - so a user can drain
 * what it has in flight at the OLD rate and program itself for the new one.
 *
 *   using Top  = brio::Clock<brio::ClockSource::pll_hse, 180'000'000,
 *                            8'000'000, brio::HseMode::bypass>;
 *   using Mid  = brio::Clock<brio::ClockSource::pll_hse,  84'000'000,
 *                            8'000'000, brio::HseMode::bypass>;
 *   using Boot = brio::Clock<brio::ClockSource::hsi, 16'000'000>;
 *   using SysClock = brio::DynamicClock<brio::Rates<Top, Mid, Boot>,
 *                                       brio::Ticker, Serial>;
 *   constexpr SysClock clock;
 *   SysClock::init();                  // Top's init: 180 MHz in over-drive
 *   SysClock::set<16'000'000>();       // the users rebased, then the HSI
 *
 * A RATE IS A TUPLE HERE TOO, and on this family it has five members, not
 * the STM32G0's three: the SYSCLK root (with the PLL ratio the search
 * folded), the REGULATOR SCALE and whether the rate needs OVER-DRIVE, the
 * FLASH LATENCY, and THE TWO APB PRESCALERS that keep PCLK1 under 45 MHz
 * and PCLK2 under 90. Every member is a constant of the `Clock` task, so
 * naming the rate names the tuple and nothing has to be repeated.
 *
 * EVERY SWITCH PASSES THROUGH 16 MHz ON THE HSI, and that is not a detour
 * but this family's arithmetic. PLLCFGR "can be written only when the PLL
 * is disabled" (7.3.2), the regulator scale "can be modified only when the
 * PLL is OFF and the HSI or HSE clock source is selected as system clock"
 * (5.1.4), and ODEN and ODSWEN are writable only "when the HSI or HSE is
 * selected as system clock". So a switch between two PLL rates has to park
 * on a root, and the park is what collapses the manuals' two orderings
 * (3.5.1: the flash latency FIRST on the way up, LAST on the way down;
 * 5.1.4: the scale up before the rate and down after it) into ONE order -
 * after the park the machine is at the family's lowest rate, so everything
 * that follows is a RISE and the rising order is the only one needed. The
 * park costs the HSI's own settling and the two switch waits; the suite
 * prints what it costs.
 *
 * The discrete-rate surface (docs/design/clock.md) is the pack's:
 * rate_count, rate_hz(i), rate_index() - what cortexm/delay.hpp dispatches
 * on so that no division runs at wait time. Two rates may share an hz (the
 * same 84 MHz from the HSI's PLL and from the HSE's are different tuples):
 * set<hz>() and set(hz) take the FIRST that matches, set_index<i>() /
 * set_index(i) name one exactly.
 *
 * Call set() only when nothing that depends on the rate is mid-transfer (a
 * bus transaction in flight is the caller's problem - in an AO system, ask
 * the bus AOs first). Main context only.
 *
 * WHAT A STOP DOES TO THIS: the part comes out of Stop on the HSI with the
 * PLL off, the HSE off, the regulator back at scale 3 and over-drive
 * disabled (pwr.hpp fact 2), while the flash latency, the prescalers and
 * every peripheral register survive. restore() re-runs the CURRENT rate's
 * entry with no fan-out - the users were configured for that rate and it is
 * that rate that comes back - and is what stm32f4/sleep.hpp's site calls
 * first thing after a wake; a rate already in force (SWS says so, which is
 * every HSI rate) costs one register read.
 */
template <typename RateList, ClockUser... Users>
struct DynamicClock;

template <typename... Rs, ClockUser... Users>
struct DynamicClock<Rates<Rs...>, Users...> {
    static constexpr bool is_static = false;
    static constexpr uint8_t rate_count = sizeof...(Rs);
    static_assert(rate_count >= 1, "brio DynamicClock: at least the boot rate");
    static_assert(rate_count <= 16, "brio DynamicClock: sixteen rates is more than any program needs");
    static_assert((Rs::is_static && ...), "brio DynamicClock: every rate is a static Clock task");
#if defined(F_CPU)
    static_assert(false, "brio DynamicClock: F_CPU must not be defined with a runtime clock");
#endif

    /// SYSCLK = HCLK now, and the two APB rates beside it - the ones a
    /// peripheral's divisor really divides (`apb_hz(clock, on_apb2)`).
    static uint32_t hz() { return hz_; }
    static uint32_t pclk1_hz() { return rate_pclk1_hz_[idx_]; }
    static uint32_t pclk2_hz() { return rate_pclk2_hz_[idx_]; }
    /// The PLL's Q output at the rate in force; 0 on a rate without a PLL.
    static uint32_t usb_hz() { return rate_usb_hz_[idx_]; }

    /// The discrete-rate surface: the pack, by position.
    static constexpr uint32_t rate_hz(uint8_t i) { return rate_hz_[i]; }
    static uint8_t rate_index() { return idx_; }
    static constexpr uint32_t rate_pclk1_hz(uint8_t i) { return rate_pclk1_hz_[i]; }
    static constexpr uint32_t rate_pclk2_hz(uint8_t i) { return rate_pclk2_hz_[i]; }
    static constexpr SysclkSource rate_source(uint8_t i) { return rate_source_[i]; }
    static constexpr RateRegime rate_regime(uint8_t i) { return rate_regime_[i]; }
    static constexpr uint8_t rate_wait_states(uint8_t i) { return rate_ws_[i]; }

    /// The regulator tuple in force now, by the mirror (the silicon's own
    /// readbacks are Pwr::scale() and Pwr::over_drive_active()).
    static RateRegime regime() { return rate_regime_[idx_]; }

