uliano/brio/brio/stm32f4/clock.hpp
    /// Is U one of the users that set() rebases? Drivers assert this in
    /// init(clock): a clocked driver forgotten in the list would keep
    /// running at the old rate in silence - a compile error instead.
    template <typename U>
    static constexpr bool rebases = (std::same_as<U, Users> || ...);

    /// The position of the first rate at `hz`, or rate_count when none.
    static constexpr uint8_t index_of(uint32_t hz) {
        for (uint8_t i = 0; i < rate_count; ++i) {
            if (rate_hz_[i] == hz) {
                return i;
            }
        }
        return rate_count;
    }
    static constexpr bool can_run_at(uint32_t hz) { return index_of(hz) < rate_count; }

    /// The boot rate (the pack's first), no fan-out: nothing is
    /// initialized yet. See Clock::init for the return.
    static bool init() { return enter(0, false); }

    /// Switch to a rate known at compile time (checked: a rate the pack
    /// does not name does not compile).
    template <uint32_t hz>
    static bool set() {
        static_assert(can_run_at(hz), "brio DynamicClock: this rate is not in the Rates pack");
        return enter(index_of(hz), true);
    }
    /// Switch to a rate chosen at run time; false (nothing changed) when
    /// the pack has no such rate.
    static bool set(uint32_t hz) {
        const uint8_t i = index_of(hz);
        if (i >= rate_count) {
            return false;
        }
        return enter(i, true);
    }
    /// The same by position, for a program whose rates share an hz.
    template <uint8_t i>
    static bool set_index() {
        static_assert(i < rate_count, "brio DynamicClock: no such rate");
        return enter(i, true);
    }
    static bool set_index(uint8_t i) {
        if (i >= rate_count) {
            return false;
        }
        return enter(i, true);
    }

    /// Put the CURRENT rate back after a Stop dropped SYSCLK to the HSI -
    /// no fan-out (the users hold the divisors for exactly this rate).
    /// True at once when SWS already reports the rate's root, and true with
    /// nothing done while a set() is in progress in thread mode (this verb
    /// is legal from an ISR - the wake's own, if a program wants the rate
    /// back before the first AO runs - and a switch parks SYSCLK on the HSI
    /// for a moment on its way to the PLL).
    static bool restore() {
        if (switching_ || Rcc::sysclk_status() == rate_source_[idx_]) {
            return true;
        }
        return enter(idx_, false);
    }
    /// A set() is between its first and its last store.
    static bool switching() { return switching_; }

private:
    static constexpr uint32_t rate_hz_[rate_count] = {Rs::hz...};
    static constexpr uint32_t rate_pclk1_hz_[rate_count] = {Rs::pclk1_hz...};
    static constexpr uint32_t rate_pclk2_hz_[rate_count] = {Rs::pclk2_hz...};
    static constexpr uint32_t rate_usb_hz_[rate_count] = {Rs::usb_hz...};
    static constexpr SysclkSource rate_source_[rate_count] = {Rs::sysclk_source...};
    static constexpr RateRegime rate_regime_[rate_count] = {Rs::regime...};
    static constexpr uint8_t rate_ws_[rate_count] = {Rs::wait_states...};

    /**
     * The switch, for one rate of the pack, in the order the file header
     * states. The mirror is written BEFORE the rate's init() so that a user
     * rebased for the new rate and a delay_us dispatching on the index
     * agree from the first instruction after the switch; a failed init()
     * returns false and the mirror then names what was ASKED, which is
     * Clock::init's own contract.
     */
    template <typename R>
    static bool enter_rate(uint8_t i, bool fan_out) {
        switching_ = true;
        // The fan-out is FIRST and at the old rate: a user drains what it
        // has in flight on the clock that is still running, and programs
        // its divisor from the rate it is handed (apb_hz_at() derives the
        // new bus rate arithmetically - the RCC still holds the old
        // prescalers here, and reading them would be reading the past).
        if (fan_out) {
            (Users::rebase(R::hz), ...);
        }
        hz_ = R::hz;
        idx_ = i;

        // THE PARK: the HSI as SYSCLK, the PLL off, over-drive left. Every
        // store that follows is refused by the silicon without it (the file
        // header), and after it the machine is at 16 MHz - so the rest is a
        // rise whichever direction the caller asked for.
        Rcc::hsi_enable(true);
        bool ok = Rcc::hsi_wait_ready();
        Rcc::sysclk_select(SysclkSource::hsi);
        ok = Rcc::sysclk_wait(SysclkSource::hsi) && ok;
        Rcc::pll_enable(false);
        ok = Rcc::pll_wait(false) && ok;
        ok = Pwr::over_drive_exit() && ok;

        ok = R::init() && ok;

        if constexpr (R::source == ClockSource::hsi) {
            // The HSI rate's own init() is a readback and the accelerator:
            // it has no reason to touch the flash or the buses, because a
            // STATIC Clock at 16 MHz starts from a machine that is already
            // there. Coming DOWN to it, both are still set for the rate
            // left behind - and the prescalers matter, because the users
            // were just rebased on the arithmetic below.
            ok = FlashWaitStates::set(R::wait_states) && ok;
            Rcc::bus_prescalers(R::apb1_div, R::apb2_div);
        }
        switching_ = false;
        return ok;
    }

    /// Dispatch by position: a fold over the pack that stops at the i-th
    /// member (no table, no RAM).
    static bool enter(uint8_t i, bool fan_out) {
        bool ok = false;
        uint8_t k = 0;
        ((k == i ? (ok = enter_rate<Rs>(k, fan_out), true) : (++k, false)) || ...);
        return ok;
    }

    static inline uint32_t hz_ = rate_hz_[0];
    static inline uint8_t idx_ = 0;
    static inline volatile bool switching_ = false;
};

} // namespace brio
